tangyangguang/Esp32Base/src/web/internal/WebAppEvents.cpp
#include "../../Esp32BaseProfile.h"

#if ESP32BASE_ENABLE_WEB && ESP32BASE_ENABLE_APP_EVENTS

#include "WebInternal.h"

namespace esp32base_web {
namespace {

enum AppEventTimeMode : uint8_t {
    APP_EVENT_TIME_ALL,
    APP_EVENT_TIME_REAL,
    APP_EVENT_TIME_UPTIME
};

struct AppEventFilter {
    uint8_t level;
    AppEventTimeMode timeMode;
    char source[12];
    char type[24];
    char reason[24];
    char q[48];
    char query[220];
};

uint32_t parseUintArg(const char* name, uint32_t fallback, uint32_t minValue, uint32_t maxValue) {
    if (!name || !g_server.hasArg(name)) {
        return fallback;
    }
    const String raw = g_server.arg(name);
    if (raw.length() == 0 || raw.length() > 10) {
        return fallback;
    }
    uint32_t value = 0;
    for (size_t i = 0; i < raw.length(); ++i) {
        const char c = raw.charAt(i);
        if (c < '0' || c > '9') {
            return fallback;
        }
        value = value * 10U + static_cast<uint32_t>(c - '0');
        if (value > maxValue) {
            return maxValue;
        }
    }
    if (value < minValue) {
        return minValue;
    }
    return value;
}

void copyArg(const char* name, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    out[0] = '\0';
    if (name && g_server.hasArg(name)) {
        strlcpy(out, g_server.arg(name).c_str(), len);
    }
}

uint8_t parseLevelArg() {
    if (!g_server.hasArg("level")) {
        return 0;
    }
    const String raw = g_server.arg("level");
    if (raw == "info") {
        return Esp32BaseAppEventLog::LEVEL_INFO;
    }
    if (raw == "warn") {
        return Esp32BaseAppEventLog::LEVEL_WARN;
    }
    if (raw == "error") {
        return Esp32BaseAppEventLog::LEVEL_ERROR;
    }
    return 0;
}

AppEventTimeMode parseTimeModeArg() {
    if (!g_server.hasArg("time")) {
        return APP_EVENT_TIME_ALL;
    }
    const String raw = g_server.arg("time");
    if (raw == "real") {
        return APP_EVENT_TIME_REAL;
    }
    if (raw == "uptime") {
        return APP_EVENT_TIME_UPTIME;
    }
    return APP_EVENT_TIME_ALL;
}

char asciiLower(char c) {
    return (c >= 'A' && c <= 'Z') ? static_cast<char>(c + ('a' - 'A')) : c;
}

bool containsIgnoreCase(const char* text, const char* query) {
    if (!query || !query[0]) {
        return true;
    }
    if (!text || !text[0]) {
        return false;
    }
    const size_t queryLen = strlen(query);
    for (const char* p = text; *p; ++p) {
        size_t i = 0;
        while (i < queryLen && p[i] && asciiLower(p[i]) == asciiLower(query[i])) {
            ++i;
        }
        if (i == queryLen) {
            return true;
        }
    }
    return false;
}

uint32_t resolveAppEventEpoch(const Esp32BaseAppEventRecord& event) {
    if (event.epochSec != 0) {
        return event.epochSec;
    }
#if ESP32BASE_ENABLE_NTP
    uint32_t epoch = 0;
    if (Esp32BaseNtp::resolveCurrentBootEvent(event.bootId, event.uptimeSec, &epoch)) {
        return epoch;
    }
#endif
    return 0;
}

uint64_t appEventUptimeMs(const Esp32BaseAppEventRecord& event) {
    return static_cast<uint64_t>(event.uptimeSec) * 1000ULL;
}

bool appEventHasRealTime(const Esp32BaseAppEventRecord& event) {
    return resolveAppEventEpoch(event) != 0;
}

bool filterMatches(const Esp32BaseAppEventRecord& event, const AppEventFilter& filter) {
    if (filter.level != 0 && event.level != filter.level) {
        return false;
    }
    const bool realTime = appEventHasRealTime(event);
    if (filter.timeMode == APP_EVENT_TIME_REAL && !realTime) {
        return false;
    }
    if (filter.timeMode == APP_EVENT_TIME_UPTIME && realTime) {
        return false;
    }
    if (filter.source[0] && strcmp(event.source, filter.source) != 0) {
        return false;
    }
    if (filter.type[0] && strcmp(event.type, filter.type) != 0) {
        return false;
    }
    if (filter.reason[0] && strcmp(event.reason, filter.reason) != 0) {
        return false;
    }
    if (filter.q[0]) {
        return containsIgnoreCase(event.source, filter.q) ||
               containsIgnoreCase(event.type, filter.q) ||
               containsIgnoreCase(event.reason, filter.q) ||
               containsIgnoreCase(event.object, filter.q) ||
               containsIgnoreCase(event.text, filter.q);
    }
    return true;
}

void appendRaw(char* out, size_t len, const char* value) {
    if (!out || len == 0 || !value) {
        return;
    }
    strlcat(out, value, len);
}

void appendUrlEncoded(char* out, size_t len, const char* value) {
    if (!out || len == 0 || !value) {
        return;
    }
    static const char hex[] = "0123456789ABCDEF";
    for (const char* p = value; *p; ++p) {
        const uint8_t c = static_cast<uint8_t>(*p);
        const bool plain = (c >= 'a' && c <= 'z') ||
                           (c >= 'A' && c <= 'Z') ||
                           (c >= '0' && c <= '9') ||
                           c == '_' || c == '-' || c == '.' || c == ':';
        char tmp[4] = "";
        if (plain) {
            tmp[0] = static_cast<char>(c);
            tmp[1] = '\0';
        } else {
            tmp[0] = '%';
            tmp[1] = hex[(c >> 4) & 0x0F];
            tmp[2] = hex[c & 0x0F];
            tmp[3] = '\0';
        }
        if (strlcat(out, tmp, len) >= len) {
            return;
        }
    }
}

void appendQueryParam(char* out, size_t len, const char* name, const char* value) {
    if (!out || len == 0 || !name || !name[0] || !value || !value[0]) {
        return;
    }
    if (out[0]) {
        appendRaw(out, len, "&");
    }
    appendRaw(out, len, name);
    appendRaw(out, len, "=");
    appendUrlEncoded(out, len, value);
}

void buildFilterQuery(AppEventFilter& filter) {
    filter.query[0] = '\0';
    if (filter.level == Esp32BaseAppEventLog::LEVEL_INFO) {
        appendQueryParam(filter.query, sizeof(filter.query), "level", "info");
    } else if (filter.level == Esp32BaseAppEventLog::LEVEL_WARN) {
        appendQueryParam(filter.query, sizeof(filter.query), "level", "warn");
    } else if (filter.level == Esp32BaseAppEventLog::LEVEL_ERROR) {
        appendQueryParam(filter.query, sizeof(filter.query), "level", "error");
    }
    if (filter.timeMode == APP_EVENT_TIME_REAL) {
        appendQueryParam(filter.query, sizeof(filter.query), "time", "real");
    } else if (filter.timeMode == APP_EVENT_TIME_UPTIME) {
        appendQueryParam(filter.query, sizeof(filter.query), "time", "uptime");
    }
    appendQueryParam(filter.query, sizeof(filter.query), "source", filter.source);
    appendQueryParam(filter.query, sizeof(filter.query), "type", filter.type);
    appendQueryParam(filter.query, sizeof(filter.query), "reason", filter.reason);
    appendQueryParam(filter.query, sizeof(filter.query), "q", filter.q);
}

AppEventFilter readFilter() {
    AppEventFilter filter = {};
    filter.level = parseLevelArg();
    filter.timeMode = parseTimeModeArg();
    copyArg("source", filter.source, sizeof(filter.source));
    copyArg("type", filter.type, sizeof(filter.type));
    copyArg("reason", filter.reason, sizeof(filter.reason));
    copyArg("q", filter.q, sizeof(filter.q));
    buildFilterQuery(filter);
    return filter;
}

bool filterActive(const AppEventFilter& filter) {
    return filter.level != 0 ||
           filter.timeMode != APP_EVENT_TIME_ALL ||
           filter.source[0] ||
           filter.type[0] ||
           filter.reason[0] ||
           filter.q[0];
}

Esp32BaseWeb::UiTone appEventLevelTone(uint8_t level) {
    switch (level) {
        case Esp32BaseAppEventLog::LEVEL_ERROR: return Esp32BaseWeb::UI_DANGER;
        case Esp32BaseAppEventLog::LEVEL_WARN: return Esp32BaseWeb::UI_WARN;
        case Esp32BaseAppEventLog::LEVEL_INFO:
        default: return Esp32BaseWeb::UI_INFO;
    }
}

