tangyangguang/Esp32Base/src/web/internal/WebAppEvents.cpp
const char* appEventLevelName(uint8_t level) {
    return Esp32BaseAppEventLog::levelName(static_cast<Esp32BaseAppEventLog::Level>(level));
}

void formatEpoch(uint32_t epoch, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    const time_t raw = static_cast<time_t>(epoch);
    struct tm tmValue;
    localtime_r(&raw, &tmValue);
    if (strftime(out, len, "%Y-%m-%d %H:%M:%S", &tmValue) == 0) {
        strlcpy(out, "-", len);
    }
}

void formatAppEventTime(const Esp32BaseAppEventRecord& event, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    const uint32_t epoch = resolveAppEventEpoch(event);
    if (epoch != 0) {
        formatEpoch(epoch, out, len);
        return;
    }
    snprintf(out, len, "uptime %llu ms", static_cast<unsigned long long>(appEventUptimeMs(event)));
}

void sendFilterLevelOption(const char* value, const char* label, uint8_t level, const AppEventFilter& filter) {
    sendChunk("<option value='");
    sendEscapedHtmlChunk(value);
    sendChunk("'");
    if (filter.level == level) {
        sendChunk(" selected");
    }
    sendChunk(">");
    sendEscapedHtmlChunk(label);
    sendChunk("</option>");
}

void sendFilterTimeOption(const char* value, const char* label, AppEventTimeMode mode, const AppEventFilter& filter) {
    sendChunk("<option value='");
    sendEscapedHtmlChunk(value);
    sendChunk("'");
    if (filter.timeMode == mode) {
        sendChunk(" selected");
    }
    sendChunk(">");
    sendEscapedHtmlChunk(label);
    sendChunk("</option>");
}

void sendFilterInput(const char* label, const char* name, const char* value, const char* cssClass) {
    sendChunk("<div class='field ");
    sendEscapedHtmlChunk(cssClass);
    sendChunk("'><label>");
    sendEscapedHtmlChunk(label);
    sendChunk("</label><input type='text' name='");
    sendEscapedHtmlChunk(name);
    sendChunk("' value='");
    sendEscapedHtmlChunk(value);
    sendChunk("'></div>");
}

void sendFiltersPanel(const AppEventFilter& filter, uint32_t per) {
    sendChunk("<section class='panel formpanel appevfilters'><h2>Filters</h2><form method='get' action='/esp32base/app-events' class='editform'><input type='hidden' name='per' value='");
    sendUintChunk(per);
    sendChunk("'><div class='fieldgrid'><div class='field short'><label>Level</label><select name='level'>");
    sendFilterLevelOption("", "All", 0, filter);
    sendFilterLevelOption("info", "Info", Esp32BaseAppEventLog::LEVEL_INFO, filter);
    sendFilterLevelOption("warn", "Warn", Esp32BaseAppEventLog::LEVEL_WARN, filter);
    sendFilterLevelOption("error", "Error", Esp32BaseAppEventLog::LEVEL_ERROR, filter);
    sendChunk("</select></div><div class='field short'><label>Time</label><select name='time'>");
    sendFilterTimeOption("", "All", APP_EVENT_TIME_ALL, filter);
    sendFilterTimeOption("real", "Real time", APP_EVENT_TIME_REAL, filter);
    sendFilterTimeOption("uptime", "Uptime", APP_EVENT_TIME_UPTIME, filter);
    sendChunk("</select></div>");
    sendFilterInput("Source", "source", filter.source, "med");
    sendFilterInput("Type", "type", filter.type, "med");
    sendFilterInput("Reason", "reason", filter.reason, "med");
    sendFilterInput("Keyword", "q", filter.q, "long");
    sendChunk("</div><div class='actions'><input type='submit' value='Apply'><a class='btnlink secondary' href='/esp32base/app-events'>Reset</a></div></form></section>");
}

void sendAppEventsSummary(const AppEventFilter& filter) {
    char count[16];
    char capacity[16];
    snprintf(count, sizeof(count), "%u", static_cast<unsigned>(Esp32BaseAppEventLog::count()));
    snprintf(capacity, sizeof(capacity), "%u", static_cast<unsigned>(Esp32BaseAppEventLog::capacity()));
    Esp32BaseWeb::beginMetricGrid();
    Esp32BaseWeb::sendMetric("Events", count);
    Esp32BaseWeb::sendMetric("Capacity", capacity);
    Esp32BaseWeb::sendMetric("Path", Esp32BaseAppEventLog::path());
    Esp32BaseWeb::sendMetric("Filter", filterActive(filter) ? "Active" : "All");
    Esp32BaseWeb::endMetricGrid();
}

void sendCsvNumber(uint64_t value) {
    char buf[24];
    snprintf(buf, sizeof(buf), "%llu", static_cast<unsigned long long>(value));
    sendChunk(buf);
}

void sendCsvInt(int32_t value) {
    char buf[16];
    snprintf(buf, sizeof(buf), "%ld", static_cast<long>(value));
    sendChunk(buf);
}

void sendCsvMaybeInt(const Esp32BaseAppEventRecord& event, uint8_t mask, int32_t value) {
    if (event.valueMask & mask) {
        sendCsvInt(value);
    }
}

void sendAppEventValueJson(const Esp32BaseAppEventRecord& event, uint8_t mask, int32_t value) {
    if (event.valueMask & mask) {
        sendIntChunk(value);
    } else {
        sendChunk("null");
    }
}

void sendValueChip(const Esp32BaseAppEventRecord& event, uint8_t mask, const char* label, int32_t value) {
    if (!(event.valueMask & mask)) {
        return;
    }
    sendChunk("<span class='evchip'>");
    sendEscapedHtmlChunk(label);
    sendChunk(" ");
    sendIntChunk(value);
    sendChunk("</span>");
}

void sendAppEventJson(const Esp32BaseAppEventRecord& event) {
    const uint32_t resolvedEpoch = resolveAppEventEpoch(event);
    sendChunk("{\"id\":");
    sendUintChunk(event.id);
    sendChunk(",\"epochSec\":");
    sendUintChunk(event.epochSec);
    sendChunk(",\"resolvedEpochSec\":");
    sendUintChunk(resolvedEpoch);
    sendChunk(",\"bootId\":");
    sendUintChunk(event.bootId);
    sendChunk(",\"uptimeSec\":");
    sendUintChunk(event.uptimeSec);
    sendChunk(",\"uptimeMs\":");
    sendUintChunk(appEventUptimeMs(event));
    sendChunk(",\"level\":\"");
    sendEscapedJsonChunk(appEventLevelName(event.level));
    sendChunk("\",\"source\":\"");
    sendEscapedJsonChunk(event.source);
    sendChunk("\",\"type\":\"");
    sendEscapedJsonChunk(event.type);
    sendChunk("\",\"reason\":\"");
    sendEscapedJsonChunk(event.reason);
    sendChunk("\",\"object\":\"");
    sendEscapedJsonChunk(event.object);
    sendChunk("\",\"code\":");
    sendUintChunk(event.code);
    sendChunk(",\"value1\":");
    sendAppEventValueJson(event, Esp32BaseAppEventLog::VALUE1, event.value1);
    sendChunk(",\"value2\":");
    sendAppEventValueJson(event, Esp32BaseAppEventLog::VALUE2, event.value2);
    sendChunk(",\"value3\":");
    sendAppEventValueJson(event, Esp32BaseAppEventLog::VALUE3, event.value3);
    sendChunk(",\"valueMask\":");
    sendUintChunk(event.valueMask);
    sendChunk(",\"flags\":");
    sendUintChunk(event.flags);
    sendChunk(",\"text\":\"");
    sendEscapedJsonChunk(event.text);
    sendChunk("\"}");
}

struct AppEventScanState {
    const AppEventFilter* filter;
    uint32_t offset;
    uint32_t limit;
    uint32_t matched;
    uint32_t rows;
};

void sendAppEventHtmlRow(const Esp32BaseAppEventRecord& event, void* user) {
    AppEventScanState* state = static_cast<AppEventScanState*>(user);
    if (!state || !state->filter || !filterMatches(event, *state->filter)) {
        return;
    }
    if (state->matched++ < state->offset || state->rows >= state->limit) {
        return;
    }
    ++state->rows;

