tangyangguang/Esp32Base/src/web/internal/WebAppEvents.cpp
    char timeText[32];
    formatAppEventTime(event, timeText, sizeof(timeText));
    sendChunk("<tr><td class='evid'>");
    sendUintChunk(event.id);
    sendChunk("</td><td class='evtime'><span>");
    sendEscapedHtmlChunk(timeText);
    sendChunk("</span><small>boot ");
    sendUintChunk(event.bootId);
    sendChunk("</small></td><td>");
    sendStatusTag(appEventLevelTone(event.level), appEventLevelName(event.level));
    sendChunk("</td><td><div class='evmain'>");
    sendEscapedHtmlChunk(event.source);
    sendChunk("</div><div class='evsub'>");
    sendEscapedHtmlChunk(event.type);
    if (event.reason[0]) {
        sendChunk(" / ");
        sendEscapedHtmlChunk(event.reason);
    }
    sendChunk("</div></td><td class='evobject'>");
    sendEscapedHtmlChunk(event.object[0] ? event.object : "-");
    sendChunk("</td><td class='evdetail'><div class='evtext'>");
    sendEscapedHtmlChunk(event.text[0] ? event.text : "-");
    sendChunk("</div><div class='evchips'><span class='evchip'>code ");
    sendUintChunk(event.code);
    sendChunk("</span>");
    sendValueChip(event, Esp32BaseAppEventLog::VALUE1, "v1", event.value1);
    sendValueChip(event, Esp32BaseAppEventLog::VALUE2, "v2", event.value2);
    sendValueChip(event, Esp32BaseAppEventLog::VALUE3, "v3", event.value3);
    sendChunk("</div></td></tr>");
}

void sendAppEventJsonRow(const Esp32BaseAppEventRecord& event, void* user) {
    AppEventScanState* state = static_cast<AppEventScanState*>(user);
    if (!state || !state->filter || !filterMatches(event, *state->filter)) {
        return;
    }
    if (state->matched++ < state->offset || state->rows >= state->limit) {
        return;
    }
    if (state->rows > 0) {
        sendChunk(",");
    }
    sendAppEventJson(event);
    ++state->rows;
}

struct AppEventCsvState {
    const AppEventFilter* filter;
    uint32_t matched;
};

void sendAppEventCsvRow(const Esp32BaseAppEventRecord& event, void* user) {
    AppEventCsvState* state = static_cast<AppEventCsvState*>(user);
    if (!state || !state->filter || !filterMatches(event, *state->filter)) {
        return;
    }
    ++state->matched;
    sendCsvNumber(event.id);
    sendChunk(",");
    sendCsvNumber(event.epochSec);
    sendChunk(",");
    sendCsvNumber(resolveAppEventEpoch(event));
    sendChunk(",");
    sendCsvNumber(event.bootId);
    sendChunk(",");
    sendCsvNumber(event.uptimeSec);
    sendChunk(",");
    sendCsvNumber(appEventUptimeMs(event));
    sendChunk(",");
    Esp32BaseWeb::writeCsvEscaped(appEventLevelName(event.level));
    sendChunk(",");
    Esp32BaseWeb::writeCsvEscaped(event.source);
    sendChunk(",");
    Esp32BaseWeb::writeCsvEscaped(event.type);
    sendChunk(",");
    Esp32BaseWeb::writeCsvEscaped(event.reason);
    sendChunk(",");
    Esp32BaseWeb::writeCsvEscaped(event.object);
    sendChunk(",");
    sendCsvNumber(event.code);
    sendChunk(",");
    sendCsvMaybeInt(event, Esp32BaseAppEventLog::VALUE1, event.value1);
    sendChunk(",");
    sendCsvMaybeInt(event, Esp32BaseAppEventLog::VALUE2, event.value2);
    sendChunk(",");
    sendCsvMaybeInt(event, Esp32BaseAppEventLog::VALUE3, event.value3);
    sendChunk(",");
    Esp32BaseWeb::writeCsvEscaped(event.text);
    sendChunk("\n");
}

void sendFilterJson(const AppEventFilter& filter) {
    sendChunk("\"filters\":{\"level\":\"");
    if (filter.level) {
        sendEscapedJsonChunk(appEventLevelName(filter.level));
    }
    sendChunk("\",\"time\":\"");
    sendEscapedJsonChunk(filter.timeMode == APP_EVENT_TIME_REAL ? "real" : (filter.timeMode == APP_EVENT_TIME_UPTIME ? "uptime" : ""));
    sendChunk("\",\"source\":\"");
    sendEscapedJsonChunk(filter.source);
    sendChunk("\",\"type\":\"");
    sendEscapedJsonChunk(filter.type);
    sendChunk("\",\"reason\":\"");
    sendEscapedJsonChunk(filter.reason);
    sendChunk("\",\"q\":\"");
    sendEscapedJsonChunk(filter.q);
    sendChunk("\"}");
}

void sendCsvLink(const AppEventFilter& filter) {
    sendChunk("<a class='btnlink' href='/esp32base/app-events.csv");
    if (filter.query[0]) {
        sendChunk("?");
        sendEscapedHtmlChunk(filter.query);
    }
    sendChunk("'>Export CSV</a>");
}

} // namespace

void handleAppEventsPage() {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    const AppEventFilter filter = readFilter();
    const uint32_t per = parseUintArg("per", 20, 1, 100);
    const uint32_t page = parseUintArg("page", 1, 1, 65535);

    Esp32BaseWeb::sendHeader(g_builtinLabels[Esp32BaseWeb::BUILTIN_APP_EVENTS]);
    Esp32BaseWeb::sendPageTitle(g_builtinLabels[Esp32BaseWeb::BUILTIN_APP_EVENTS], "Application event log");
    if (g_server.hasArg("cleared")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "App Events cleared");
    } else if (g_server.hasArg("error")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "App Events action failed", g_server.arg("error").c_str());
    }
    if (Esp32BaseAppEventLog::faulted()) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "App Events storage fault", Esp32BaseAppEventLog::lastError());
    } else if (!Esp32BaseAppEventLog::isReady()) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "App Events unavailable", Esp32BaseAppEventLog::lastError());
    }
    sendAppEventsSummary(filter);
    sendFiltersPanel(filter, per);

    sendChunk("<section class='panel actionpanel'><h2>Actions</h2><div class='actions'>");
    sendCsvLink(filter);
    sendChunk("<form method='post' action='/esp32base/app-events/clear' onsubmit=\"return confirm('Clear App Events?')&&once(this)\"><input class='danger' type='submit' value='Clear App Events'></form></div></section>");

    uint32_t offset = (page - 1U) * per;

    sendChunk("<section class='panel'><h2>Events</h2><div class='tablewrap'><table class='evtable'><tr><th>ID</th><th>Time</th><th>Level</th><th>Event</th><th>Object</th><th>Details</th></tr>");
    AppEventScanState state = {&filter, offset, per, 0, 0};
    const bool readOk = Esp32BaseAppEventLog::readLatest(0,
                                                         Esp32BaseAppEventLog::count(),
                                                         sendAppEventHtmlRow,
                                                         &state);
    if (!readOk) {
        sendChunk("<tr><td colspan='6'>App Events unavailable: ");
        sendEscapedHtmlChunk(Esp32BaseAppEventLog::lastError());
        sendChunk("</td></tr>");
    } else if (state.rows == 0) {
        sendChunk("<tr><td colspan='6'>No App Events</td></tr>");
    }
    sendChunk("</table></div></section>");
    Esp32BaseWeb::Pagination pagination = {"/esp32base/app-events", filter.query, page, per, state.matched};
    Esp32BaseWeb::sendPagination(pagination);
    Esp32BaseWeb::sendFooter();
}

