tangyangguang/Esp32Base/src/web/internal/WebAppEvents.cpp
void handleAppEventsApi() {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    // Route marker: /esp32base/api/app-events
    const AppEventFilter filter = readFilter();
    const uint32_t offset = parseUintArg("offset", 0, 0, 65535);
    const uint32_t limit = parseUintArg("limit", 50, 1, 100);
    if (!beginResponse(200, "application/json", nullptr)) {
        return;
    }
    sendChunk("{\"kind\":\"app_events\",\"path\":\"/esp32base/api/app-events\",\"count\":");
    sendUintChunk(Esp32BaseAppEventLog::count());
    sendChunk(",\"capacity\":");
    sendUintChunk(Esp32BaseAppEventLog::capacity());
    sendChunk(",\"offset\":");
    sendUintChunk(offset);
    sendChunk(",\"limit\":");
    sendUintChunk(limit);
    sendChunk(",\"faulted\":");
    sendChunk(Esp32BaseAppEventLog::faulted() ? "true" : "false");
    sendChunk(",");
    sendFilterJson(filter);
    sendChunk(",\"events\":[");
    AppEventScanState state = {&filter, offset, limit, 0, 0};
    const bool readOk = Esp32BaseAppEventLog::readLatest(0,
                                                        Esp32BaseAppEventLog::count(),
                                                        sendAppEventJsonRow,
                                                        &state);
    sendChunk("],\"total\":");
    sendUintChunk(state.matched);
    sendChunk(",\"readOk\":");
    sendChunk(readOk ? "true" : "false");
    sendChunk(",\"ok\":");
    sendChunk((readOk && !Esp32BaseAppEventLog::faulted()) ? "true" : "false");
    sendChunk(",\"lastError\":\"");
    sendEscapedJsonChunk(Esp32BaseAppEventLog::lastError());
    sendChunk("\"}");
    endResponse();
}

void handleAppEventsCsv() {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    const AppEventFilter filter = readFilter();
    if (!Esp32BaseWeb::beginCsv(200, "app-events.csv")) {
        return;
    }
    sendChunk("id,epoch_sec,resolved_epoch_sec,boot_id,uptime_sec,uptime_ms,level,source,type,reason,object,code,value1,value2,value3,text\n");
    AppEventCsvState state = {&filter, 0};
    const bool readOk = Esp32BaseAppEventLog::readLatest(0, Esp32BaseAppEventLog::count(), sendAppEventCsvRow, &state);
    if (!readOk) {
        ESP32BASE_LOG_W("app_events", "csv_export_incomplete error=%s", Esp32BaseAppEventLog::lastError());
        sendChunk("# error,");
        Esp32BaseWeb::writeCsvEscaped(Esp32BaseAppEventLog::lastError());
        sendChunk("\n");
    }
    endResponse();
}

void handleAppEventsClearPost() {
    markRequest();
    if (!ensurePostAllowed("app_events_clear")) {
        return;
    }
    const bool ok = Esp32BaseAppEventLog::clear();
    redirectSeeOther(ok ? "/esp32base/app-events?cleared=1" : "/esp32base/app-events?error=clear_failed");
}

} // namespace esp32base_web

#endif
